Repository: 84000/data-translation-memory
Catalog: Toh_157-The_Questions_of_the_Kimnara_King_Druma-v2.tmx
Source language: bo
Languages: en

source: གང་དག་བཅོམ་ལྡན་འདས་ལ་ཆོས་ཉན་ཞིང་ཞབས་འབྲིང་དུ་འབྲང་བ་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ན་སྤྱོད་པ་དང་། གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་དེ་དག་གི་སྟན་ཡང་ཤིང་རྟ་དེའི་སྟེང་དུ་ཅི་རིགས་པར་སྤྲུལ་ཏོ། །
en: Above the chariot, he also emanated appropriate seats for those who had heard the Dharma from the Blessed One and followed him as servants—Śakra, Brahmā, the protectors of the world, the gods of the desire realm, the gods of the form realm, and the gods of the pure realms.

source: དེ་ནས་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་དེ་ལྟ་བུའི་ཤིང་རྟ་བཀོད་པ་དེ་སྤྲུལ་ནས་ཐལ་མོ་སྦྱར་ཏེ། བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: After he had manifested that chariot, the kiṃnara king Druma then joined his palms together, prostrated to the Blessed One, and requested,

source: བཅོམ་ལྡན་འདས་བདག་ལ་ཐུགས་བརྩེ་བའི་སླད་དུ་ཤིང་རྟ་འདི་ལ་ཇི་ལྟར་གདན་བཤམས་པ་རྣམས་ལ་འཁོར་ཐམས་ཅད་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སུ་གསོལ།
en: “Blessed One, out of love for me, please sit in this chariot, with your entire retinue, on these seats I have arranged for you!”

source: དེ་ནས་སེང་གེའི་ཁྲི་དེ་ལ་བཅོམ་ལྡན་འདས་ཀྱང་བཞུགས།
en: The Blessed One took his seat on the lion throne, and

source: བྱང་ཆུབ་སེམས་དཔའ་དང་། དགེ་སློང་གི་དགེ་འདུན་དང་འཁོར་ཐམས་ཅད་ཀྱང་ཅི་རིགས་པར་འཁོད་དོ། །
en: the saṅgha of bodhisattvas, the saṅgha of monks, and the entire retinue also sat down on their respective seats.

source: དེ་ནས་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་ཤིང་རྟ་དེ་ལག་པ་གཡས་པས་བླངས་ཏེ། ཤིང་ཏ་ལ་བདུན་སྲིད་ཀྱི་སྟེང་གི་བར་སྣང་ལ་འཕགས་ནས།
en: Then, through his miraculous powers , the kiṃnara king Druma placed the chariot in his right hand and raised it into the air at an elevation of seven palm trees.

source: དེ་ནས་མི་འམ་ཅི་མོ་བརྒྱད་ཁྲི་བཞི་སྟོང་དེ་དག་ཐམས་ཅད་དང་བུ་བརྒྱད་སྟོང་པོ་དེ་དག་དང་གཞན་ཡང་མི་འམ་ཅི་དང་དྲི་ཟ་དང་ལྟོ་འཕྱེ་ཆེན་པོ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་ཉིད་ཀྱང་རིན་པོ་ཆེའི་ཐག་པ་ཐོགས་ནས་ཤིང་རྟ་ལ་བཏགས་ཏེ་ནམ་མཁའ་ལས་དྲངས་སོ། །
en: All the eighty-four thousand kiṃnarīs, the eight thousand sons, the hundred thousand kiṃnaras, gandharvas, and mahoragas, and the kiṃnara king Druma himself took bejewelled ropes, attached them to the chariot, and pulled it through the sky.

source: དེ་ནས་བཅོམ་ལྡན་འདས་སྟེང་གི་བར་སྣང་གི་ཤིང་རྟ་ལ་བཞུགས་ཤིང་། ནམ་མཁའི་དཀྱིལ་ནས་གཤེགས་པ་ལ་མི་འམ་ཅི་མོ་བརྒྱད་ཁྲི་བཞི་སྟོང་པོ་དེ་དག་གིས་སིལ་སྙན་དང་། གླུ་དབྱངས་བླངས་ནས་མཆོད་པ་བྱེད་དེ་
en: As the Blessed One sat in the chariot traveling through the sky, the eighty-four thousand kiṃnarīs worshiped him while playing music and singing songs.

source: མདུན་དུ་དོང་ཞིང་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །
en: Coming before him, they offered these verses of praise:

source: མི་འམ་ཅི་མོ་བརྒྱད་ཁྲི་བཞི་སྟོང་པོ། །གཟུགས་ཀྱི་དམ་པ་དང་ནི་ལྡན་པ་དག །སིལ་སྙན་རྣམས་ནི་རབ་ཏུ་དཀྲོལ་བགྱིད་ཅིང་། །ཡང་དག་བསྔགས་པས་འདྲེན་ལ་བསྟོད་པ་བགྱིད། །
en: “We, the eighty-four thousand kiṃnarīs With sublime physiques, Offer praises to the Great Guide By playing our instruments for him.

source: མཚན་མཆོག་བསོད་ནམས་ཀྱིས་ནི་གཟི་བརྗིད་གྱུར། །
en: “With the merit of the supreme marks you are splendorous.

source: གཟུགས་མཆོག་མཐོང་ན་དགའ་བར་བགྱིད་པའི་གཟུགས། །བདེན་པའི་ཡོན་ཏན་ལ་ནི་རྟག་གནས་པ། །ཡོན་ཏན་མཚོ་ཆེན་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: With your supreme physical form, whoever sees you is filled with joy, And you always abide by the qualities of the truth; Great ocean of qualities, we prostrate to you!

source: སྔོན་གྱི་རྒྱལ་བ་རྣམས་དང་ཁྱོད་མི་འདྲ། །གཡས་གཡོན་ན་ཡང་རྣམ་པར་མཐོང་མ་མྱོང་། །
en: “Peerless among the victors of the past, We have never seen anyone like you anywhere.

source: ཇི་ལྟར་རི་རབ་བརྟན་ཞིང་མི་གཡོ་བ། །དེ་ལྟར་ཁྱེད་ཀྱི་སྐུ་ནི་དཔལ་གྱིས་མཛེས། །
en: Your body, steadfast and unwavering like Mount Sumeru, Blazes with splendor.

source: འདྲེན་པ་ཁྱོད་ཀྱིས་རྫུ་འཕྲུལ་སྟོབས་ཀྱིས་ནི། །ཆགས་པ་མ་མཆིས་པར་ཡང་མཁའ་ལས་མཆི། །
en: “Guide, through your miraculous powers, You move through space unobstructedly.

source: ནམ་མཁའ་ལྟ་བུར་དག་ཅིང་དྲི་མི་མངའ། །
en: Like the sky, you are immaculate and stainless;

source: བཅོམ་ལྡན་ཉོན་མོངས་བསལ་ལ་ཕྱག་འཚལ་ལོ། །
en: Blessed One, dispeller of afflictions, we prostrate to you!

source: ལྷ་དབང་ལྷ་མིན་དབང་དང་སྲིན་པོ་དང་། །བརྒྱ་བྱིན་ཚངས་པ་དང་ནི་དག་པའི་ལྷ། །ཉི་མ་ཟླ་བ་སྐར་མར་བཅས་པའི་འོད། །ཁྱེད་ཀྱི་མཛོད་སྤུས་འོད་ནི་མ་མཆིས་གྱུར། །
en: “The light shining through the circle of hair between your eyebrows Eclipses the light emitted by the lord of the gods, the lord of the demigods, The rākṣasas, Śakra, Brahmā, the gods of the pure realms, The sun, the moon, and the stars.

source: ཤེས་རབ་འབྱུང་གནས་ཤེས་རབ་རྒྱ་མཚོ་ལྡན། །
en: “You are a source of insight and you have an ocean of insight.

source: སེམས་ཅན་ཀུན་གྱི་སེམས་ཀྱི་སྤྱོད་ལ་མཁས། །
en: You are an expert in the thoughts of all beings, And

source: འཇིག་རྟེན་གསུམ་ན་འཇིག་རྟེན་གསུམ་གྱིས་མཆོད། །
en: you are worshiped by everyone within the three worlds;

source: འཇིག་རྟེན་གྲགས་པའི་ཞབས་ལ་ཕྱག་འཚལ་ལོ། །
en: You who are renowned in the world, we prostrate at your feet!

source: བདུད་བཞི་པོ་ཡི་སྐྱོན་རྣམས་བསལ་བ་པོ། །བདེན་པ་བཞི་ལ་བསྒོམ་ཞིང་དཔྱོད་མཛད་པ། །རྫུ་འཕྲུལ་བཞི་ཡི་སྟོབས་ཀྱིས་བསྙེངས་མི་མངའ། །
en: “You have ended the harm of the four Māras, You have cultivated and analyzed the four truths, And through your four magical powers you know no fear.

source: སངས་རྒྱས་གཤེགས་པས་གཤེགས་ཏེ་གཤེགས་པ་མཛེས། །བསྐལ་པ་བརྒྱར་ཡང་སྐྱོ་བ་མི་མངའ་ཞིང་། །རྟག་ཏུ་དུལ་ལ་ཐུགས་ནི་མཉམ་པར་བཞག །
en: You walk with the gait of a buddha—that beautiful gait. “Even after a hundred eons, you never become weary, And your mind always remains calm and composed.

source: ལེགས་པར་གསུངས་པས་འགྲོ་བ་ཚིམ་མཛད་ཀྱང་། །ཁྱོད་ནི་ཚིག་དང་སྐད་ལ་གནས་མ་ལགས། །
en: Although you satisfy beings through your excellent words, You do not fixate on words and language.

source: ཁྱོད་ཀྱི་གསུང་ནི་ཡིད་འོང་རབ་ཏུ་སྙན། །ཞིང་བརྒྱ་དག་ཏུ་ཐོགས་པ་མེད་པར་མཆི། །
en: “Your speech, pleasant and delightful, Resonates without obstruction in hundreds of universes, And

source: སྒྲ་ནི་སེམས་ཅན་གང་གིས་ཐོས་གྱུར་པ། །དེ་དག་ཐམས་ཅད་བདེ་བས་ཚིམ་པར་འགྱུར། །
en: those who hear your voice Are filled with happiness.

source: སེམས་ཅན་ཁ་ལོ་སྒྱུར་བ་སྤུ་གཅིག་ཏུ། །སྟོང་གསུམ་རྒྱ་མཚོའི་ཆབ་རྣམས་ཞུགས་གྱུར་ཀྱང་། །
en: “Charioteer of beings, with a mere hair pore of your body, You could absorb the waters of all the oceans of this trichiliocosm, And yet

source: སེམས་ཅན་རགས་པ་རྣམས་ལའང་མི་གནོད་ལ། །
en: it would not harm the material beings there at all —

source: རྫུ་འཕྲུལ་ལ་ཡང་སྐྱོན་ནི་ཡོང་མི་གདའ། །
en: Your magical powers are completely faultless.

source: སྟོང་གསུམ་གྱི་ནི་རི་བོ་རི་རབ་དག །ཕྱག་གཅིག་གི་ནི་མཐིལ་དུ་བཞག་ནས་སུ། །ཞིང་མང་བྱེ་བ་དག་ཏུ་གཤེགས་མཛད་ཀྱང་། །
en: “Even when you travel to many millions of universes While holding Mount Sumeru and all the mountains of this trichiliocosm In the palm of your hand,

source: ཁྱོད་ཀྱི་སྐུ་ཡི་སྟོབས་ནི་ཞུམ་མ་མཆིས། །
en: Your physical power remains undiminished.

source: ཁྱོད་ནི་བསྐལ་པ་བརྒྱ་ཕྲག་བསམ་ཡས་ནས། །བརྟུལ་ཞུགས་དཀའ་ཐུབ་ཚུལ་ཁྲིམས་ཡོན་ཏན་དང་། །སྦྱིན་དང་དུལ་དང་སྡོམ་དང་བཟོད་པ་དང་། །བརྩོན་འགྲུས་བསམ་གཏན་ཤེས་རབ་ཤིན་ཏུ་བསླབས། །
en: “For countless hundreds of eons, You have trained in disciplined conduct, austerities, The qualities of discipline, generosity, self-control, Restraint, patience, diligence, concentration, and insight.

source: སངས་རྒྱས་བྱེ་བ་མང་ལ་བསྙེན་བཀུར་མཛད། །དེ་དག་རྣམས་ཀྱིས་བཤད་པའི་ཆོས་ཀྱང་བཟུང་། །
en: “You have served many millions of buddhas And upheld the Dharma they taught.

source: ཐུགས་རྗེ་ལྡན་ཞིང་འགྲོ་བའི་དོན་གྱི་ཕྱིར། །ཁྱོད་ལ་ཡོངས་སུ་སྐྱོ་བའི་ཐུགས་མི་མངའ། །
en: You are endowed with great compassion And never tire of benefiting beings.

source: རིམ་གྲོར་མ་བགྱིས་ཞུམ་པར་མི་འགྱུར་ཞིང་། །རིམ་གྲོ་བགྱིས་པས་མཐོ་བར་འགྱུར་མ་ལགས། །
en: “You never become weary when others do not honor you, And you never feel flattered when you are honored.

source: དོག་ས་ལྟ་བུར་སྙོམས་ཤིང་མི་གཡོ་སྟེ། །
en: Like the earth, you are even and unshakable.

source: འཇིག་རྟེན་ཆོས་གནས་མི་གོས་པད་མ་བཞིན། །
en: Like a lotus, you remain untainted by worldly concerns.

source: ཆོས་རྣམས་སྟོང་པ་མཚན་མ་མ་མཆིས་དང་། །ཆུ་ཟླ་འདྲ་ཞིང་སྒྱུ་མ་ལྟ་བུ་དང་། །དབུ་བ་རྡོས་འདྲ་རྨི་ལམ་གློག་འདྲ་དང་། །སྨིག་རྒྱུའི་མཚན་ཉིད་ལྟ་བུར་རབ་ཏུ་མཁྱེན། །
en: “You know that empty phenomena are without marks, And that they have the same characteristics As reflections of the moon in water, illusions, Water bubbles, dreams, lightning, and mirages.

source: ངོ་བོ་ཉིད་ཀྱིས་གང་ཟག་བདག་མ་མཆིས། །
en: “Persons are essentially selfless—

source: གདོད་ནས་སྟོང་ཞིང་མི་གཡོ་རྗེས་མ་མཆིས། །ནམ་མཁའ་ལྟ་བུར་དག་ཅིང་དྲི་མ་མཆིས། །
en: They are primordially empty, unmoving, and unchanging, Immaculate and stainless like the sky.

source: དངོས་པོ་བས་པར་དངོས་པོ་མ་མཆིས་འདྲ། །ལས་དང་བྱ་བརྒྱུ་དང་རྐྱེན་རྣམས་ལས། །བྱུང་བ་ལགས་ཀྱི་རྗེས་ནི་མ་མཆིས་པར། །ཚུལ་འདི་རྣམ་པར་སྦྱང་བ་མཛད་པས་ན། །དེ་ཕྱིར་ཁྱོད་ནི་རྫོགས་སངས་རྒྱས་ཞེས་བགྱི། །
en: They are like things that disappear when they are used up. “Actions and deeds originate from causes and conditions; They appear, but disappear later on; Since you have completely purified this mode of being, You are known as the Perfect Buddha.

source: གང་དག་འདྲེན་པ་མཐོང་ཞིང་ཐོས་གྱུར་པ། །དེ་དག་ལ་ནི་ངན་སོང་འཇིགས་མ་མཆིས། །དེ་དག་བདེ་འགྲོ་དག་ཏུ་མཆོག་གཞོལ་ཏེ། །
en: “Great leader, those who see and hear you Are free from the fear of the lower realms And become destined for the higher realms—

source: སྲོག་ཆགས་དེ་རྣམས་ཀྱི་ནི་རྙེད་པ་ལགས། །
en: Such are the gains of those beings.

source: བདག་ཅག་རྣམས་ཀྱིས་གང་ཟག་དམ་པ་ཁྱོད། །ཀུན་ཏུ་མཆོད་པས་མཆོད་པ་བགྱིས་ནས་སུ། །བྱང་ཆུབ་ཏུ་ནི་སེམས་ཀྱང་བསྐྱེད་བགྱིས་ཏེ
en: “Sublime being, we worship you, And while doing so, We also give rise to the mind set on awakening;

source: གང་ཟག་མཆོག་འདྲར་ཐམས་ཅད་འགྱུར་བར་ཤོག །
en: May all beings become like you, sublime being!

source: ནམ་མཁའ་ལ་ནི་དཔག་ཏུ་ནུས་ཀྱང་གདའ། །
en: “The limits of space could be measured,

source: རྒྱ་མཚོའི་ཆབ་ནི་བས་བགྱིར་ནུས་ཀྱང་གདའ། །
en: The water of the oceans could be emptied, And

source: ཉི་ཟླ་མཁའ་ལས་སར་ནི་ལྟུང་གདའ་ཡི། །
en: the sun and the moon could fall to the ground, But

source: སངས་རྒྱས་ཡོན་ཏན་བས་པར་འགྱུར་མི་གདའ། །
en: your awakened qualities will never be exhausted!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཤིང་རྟ་ལ་བཞུགས་ཏེ་ནམ་མཁའི་དཀྱིལ་གྱི་ལམ་ནས་གཤེགས་པས་གཤེགས་ཤིང་། གསེར་གྱི་ཁ་དོག་ལྟ་བུར་སྐུ་ལས་འོད་གང་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཁྱབ་པར་འགྱུར་བ་དེ་ལྟ་བུའི་འོད་ཕྱུང་བ་དང་། འོད་དེས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་དང་། བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ཡང་རབ་ཏུ་ཁྱབ་པར་གྱུར་ཏོ། །
en: The golden-colored body of the Blessed One, as he traveled through the sky sitting in the chariot, shone with light that spread throughout this great trichiliocosm. The light also illuminated the city of Rājagṛha and Vulture Peak Mountain.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཤིང་རྟ་དེས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་དང་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ག་ལ་བ་དེར་གཤེགས་སོ། །
en: In this way the Blessed One reached the city of Rājagṛha and Vulture Peak Mountain.

source: དེ་ནས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་གྱི་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་བློན་པོ་དང་། རྒྱལ་བུ་དང་། ཚོང་དཔོན་དང་། གྲོང་རྡལ་པ་དང་། ཁྱིམ་བདག་ཏུ་བཅས་པ་དང་། དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་རྣམས་འོད་དེས་བསྐུལ་ནས་ཕྱི་དྲོའི་དུས་ཀྱི་ཚེ་མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་བ་དན་ཐོགས་ཏེབཅོམ་ལྡན་འདས་བསུ་བའི་ཕྱིར་རིངས་པ་རིངས་པར་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་བྱུང་སྟེ།
en: Inspired by that light, King Ajātaśatru and his ministers, princes, merchants, townsmen, and householders, as well as the monks, nuns, and male and female lay practitioners, hastily came out of the great city of Rājagṛha to welcome the Blessed One in the afternoon, carrying with them flowers, incense, perfumes, garlands, ointments, parasols, banners, and flags.

source: བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་ངོ་། །
en: When they arrived at Vulture Peak Mountain to meet the Blessed One,

source: སྡོང་པོའི་སླས་རྣམས་ཤིང་རྟ་འདྲེན་བཞིན་དུ་སིལ་སྙན་བརྒྱད་ཁྲི་བཞི་སྟོང་བྱེད་དོ། །མི་འམ་ཅི་མོའི་རོལ་མོ་སིལ་སྙན་གྱི་སྒྲ་དེས་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ཐམས་ཅད་དུ་གྲག་པར་གྱུར་ཏོ། །
en: the tunes from the eighty-four thousand instruments played by Druma’s queens as they guided the chariot resounded over the entire mountain.

source: དེ་ལྟར་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་དཔུང་དང་བཅས། འཁོར་དང་བཅས་པས་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་བཅོམ་ལྡན་འདས་ནམ་མཁའི་དཀྱིལ་ནས་ཁྱེར་ཏེ་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་བཞག་གོ། །
en: In this way the kiṃnara king Druma with his armies and retinues miraculously transported the Blessed One through the sky and arrived at Vulture Peak Mountain.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཤིང་རྟ་དེ་ལས་བབས་ནས་རང་གི་གནས་སུ་གདན་བཤམས་པ་ལ་བཞུགས་སོ། །
en: Once arrived, the Blessed One descended from the chariot and sat on the seat that had been arranged for him in his place.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་ཉན་ཐོས་ཆེན་པོ་དེ་དག་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་རྣམས་ཀྱང་ཤིང་རྟ་དེ་ལས་བབས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: The bodhisattvas, the hearers, and the entirety of the retinues also descended from the chariot and prostrated to the feet of the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱིས་གནང་ནས་བཅོམ་ལྡན་འདས་ལ་ཀུན་ནས་བསྐོར་ཏེ་རང་རང་གི་སྟན་ལ་འཁོད་དོ། །
en: After receiving his consent, they circumambulated the Blessed One and sat on their respective seats.

source: འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ན་སྤྱོད་པ་དང་། གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་དེ་དག་ཀྱང་ཤིང་རྟ་དེ་ལས་བབས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: The gods of the desire realm, the gods of the form realm, and the gods of the pure realms also descended from the chariot, prostrated to the feet of the Blessed One, and sat on one side.

source: དེ་ནས་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་བློན་པོ་དང་། རྒྱལ་བུ་དང་། ཚོང་དཔོན་དང་། ཁྱིམ་བདག་དང་། གྲོང་རྡལ་པ་དང་བཅས་པ་དང་། དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་རྣམས་ཀྱིས་མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ཆོས་གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་ཇི་ལྟར་ཐོགས་པ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ
en: Then, King Ajātaśatru and his ministers, princes, merchants, householders, and townsmen, as well as the monks, nuns, and male and female lay practitioners, offered the Blessed One the flowers, incense, perfumes, garlands, ointments, powders, Dharma robes, parasols, banners, and flags they were carrying, prostrated at his feet, and

source: བཅོམ་ལྡན་འདས་ལ་སྐུ་མ་མཉེལ་ཏམ། བདེ་བ་ལ་རེག་པར་གནས་སམ་ཞེས་གསོལ་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: asked him, “Blessed One, are you not tired? Are you well?” They then sat to one side.

source: བཅོམ་ལྡན་འདས་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་གཡོག་འཁོར་དང་བཅས་པས་བཅོམ་ལྡན་འདས་འཁོར་དང་བཅས་ཏེ། ཤིང་རྟ་ལ་བཞུགས་པ་ནམ་མཁའི་དཀྱིལ་ནས་དྲངས་པའི་དགེ་བའི་རྩ་བ་འདིས་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོའི་འཁོར་དང་བཅས་པས་ཅི་ཞིག་འཐོབ་པར་འགྱུར།
en: “Blessed One, what will the kiṃnara king Druma and his subjects achieve through the roots of virtue created by pulling the chariot, where the Blessed One and his retinues were sitting, through the sky?”

source: དགེ་བའི་རྩ་བ་དེས་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་སླས་དང་བཅས། བུ་དང་བཅས། གཡོག་དང་བཅས་པས་འདིར་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས་དེ་དག་ཐམས་ཅད་ནམ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་གི་བར་དུ་མངོན་པར་ཤེས་པ་ལས་མི་ཉམས་པ་རབ་ཏུ་ཐོབ་པར་འགྱུར།
en: “Through these roots of virtue, the kiṃnara king Druma, his queens, his sons, and his servants will give rise to the mind set on awakening and, until they reach the seat of awakening, they will develop the higher perceptions, and these will never diminish.

source: སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་ཕན་ཚུན་འགྲོ་བར་འགྱུར། སངས་རྒྱས་མཐོང་བ་དང་། ཆོས་ཉན་པ་དང་། དགེ་འདུན་ལ་བསྙེན་བཀུར་བྱེད་པ་དང་མི་འབྲལ་བར་འགྱུར།
en: They will continuously travel from one buddha realm to the next, behold buddhas, listen to their Dharma, and revere the Saṅgha.

source: ཚེ་རབས་ཐམས་ཅད་དུ་སྐྱེ་བ་དྲན་པར་འགྱུར། ལུང་བསྟན་པ་ཐོབ་པར་འགྱུར། དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བ་ལ་བརྩོན་པར་འགྱུར། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་སྤྲོ་བར་འགྱུར་རོ། །
en: During all their lifetimes, they will recollect their former lives, receive prophecies, exert themselves in upholding the sacred Dharma, and enthusiastically ripen beings.”

source: དེ་ནས་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་མི་འམ་ཅིའི་བདག་པོ་སྡོང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: King Ajātaśatru then said to the kiṃnara king Druma,

source: མི་འམ་ཅིའི་བདག་པོ་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱོད་ཀྱི་ཡོན་ཏན་ཡོངས་སུ་བརྗོད་པ་མཛད་པས་ཁྱོད་ཀྱིས་རྙེད་པ་ལེགས་པར་རྙེད་ཀྱིས་ཁྱོད་ཀྱིས་དགེ་བའི་རྩ་བ་དེ་ལས་ཤས་ཤིག་ཁོ་བོས་ཀྱང་ཐོབ་པར་འདོད་དོ། །
en: “Lord of the kiṃnaras, the Blessed One has described your qualities. You are very fortunate! I would like to obtain a portion of your roots of virtue myself!”

source: མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་སྨྲས་པ།
en: replied the kiṃnara king Druma,

source: རྒྱལ་པོ་ཆེན་པོ་དགེ་བའི་རྩ་བ་འདི་ཐམས་ཅད་བདག་གིས་ཁྱོད་དང་སེམས་ཅན་ཐམས་ཅད་ལ་དབུལ་ལོ། །
en: “Your Majesty,” “I offer the entirety of these roots of virtue to you and all beings.

source: རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་ནི་གང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་མ་ཡིན་པ་དེ་གང་ཡང་མེད་དོ། །
en: Because, Your Majesty, there are no roots of virtue of bodhisattvas that are not shared with all beings.

source: རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ནི་སེར་སྣ་ཅན་མ་ཡིན་ཏེ།
en: Your Majesty, there are no miserly bodhisattvas;

source: དེ་དག་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ལ་སེར་སྣ་མི་བསྐྱེད་དོ། །
en: they do not develop miserliness with respect to any of their roots of virtue.

source: དགེ་བའི་རྩ་བ་ཐམས་ཅད་སེམས་ཅན་ཐམས་ཅད་ལ་གཏོང་ཡང་ཡིད་མི་བདེ་བར་མི་བགྱིད། འགྱོད་པར་མི་འགྱུར་རོ། །
en: Even though they give away all their roots of virtue to all beings, they do not experience any anguish or any regret while doing so.

source: རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའི་དགེ་བའི་རྩ་བ་གང་ཐམས་ཅད་མཁྱེན་པར་ཡོངས་སུ་བསྔོས་པ་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཚོ་བར་འགྱུར་རོ། །
en: Your Majesty, the roots of virtue that the bodhisattvas dedicate to omniscience will sustain all beings.

source: རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་གནས་བྱེད་པ་དང་། སེམས་ཅན་ལ་སྦྱོར་བ་དང་། སེམས་ཅན་གྱི་ཕྱིར་འབྲང་བར་འགྱུར་རོ། །
en: Because, Your Majesty, the awakening of the bodhisattvas will support, reach, and accompany all beings.

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་གང་གི་ཕྱིར་དགེ་བའི་བཤེས་གཉེན་བཅོམ་ལྡན་འདས་དང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་རྙེད་དེ།
en: Your Majesty, this is the reason you have met those two virtuous friends—the Blessed One and Mañjuśrī­kumāra­bhūta.

source: དེ་གཉིས་ལས་ཁྱོད་ཀྱིས་དམ་པའི་ཆོས་ཐོས་ནས་
en: You have heard the sacred Dharma from them, and

source: དེས་མི་ཤེས་པའི་མུན་པ་དང་། གཏི་མུག་གི་ལིང་ཏོག་ཆེན་པོས་མཚམས་མེད་པའི་འགྱོད་པ་བྱང་བའི་སེམས་བསལ་ནས་
en: it has cleared away the darkness of your unknowing and the great cataracts of ignorance from which boundless regrets arose.

source: ཁྱོད་ཀྱིས་ཆོས་ལ་ཆོས་ཀྱི་སྣང་བ་ཆེན་པོ་ཐོབ་སྟེཆོས་ཀྱི་སྣང་བ་དེས་ཁྱོད་ད་ལྟར་སྒྲིབ་པ་མེད་པ་ཐོབ་ཅིང་གནས་པས་ཁྱོད་ཀྱིས་ཀྱང་རྙེད་པ་ལེགས་པར་རྙེད་དོ། །
en: You have thus achieved the great light of Dharma that illuminates the Dharma, through which you have now reached freedom from obscuration and abide in that. You are therefore also very fortunate!

source: རྒྱལ་པོ་ཆེན་པོ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་གུས་པར་བྱས་ཏེ། ཇི་ནས་ཀྱང་ཆོས་ཀྱི་ཚིག་དང་། ཡི་གེ་འབྲུ་གཅིག་ཐོས་པའང་བརྗེད་པར་མི་འགྱུར་བ་དང་། ཆུད་ཟ་བར་མི་འགྱུར་བ་དང་། ཀུན་ཏུ་བཟུང་བ་དང་། ཡོངས་སུ་བསྲུང་བའི་ཕྱིར་བ་དག་ཆོས་ཀྱི་སྣོད་དུ་འགྱུར་བར་བྱའོ། །
en: Thus, Your Majesty, bodhisattva great beings should, devotedly and by all means, become vessels for the Dharma so that they never forget even a single Dharma word or letter after hearing them—so that they never squander them, but uphold them and guard them.”

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་སྣོད་དུ་འགྱུར་བ་ལགས།
en: “Blessed One, how do bodhisattvas become vessels for the Dharma?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ལྷའི་ཅོད་པན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: replied the Blessed One,

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་སུམ་ཅུ་རྩ་གཉིས་དང་ལྡན་ན་ཆོས་ཀྱི་སྣོད་དུ་འགྱུར་རོ། །
en: “Noble son,” “if bodhisattva great beings possess thirty-two qualities, they will be vessels for the Dharma.

source: འདི་ལྟ་སྟེ། རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་སྣོད་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་དང་། ལྷག་པའི་བསམ་པའི་སྣོད་བསམ་པ་དང་། བྱང་ཆུབ་ཀྱི་ལམ་ཉེ་བར་སྟོན་པའི་སྣོད་སྦྱོར་བ་དང་། དགེ་བའི་རྩ་བ་ཁྱད་པར་དུ་འགྲོ་བའི་སྣོད་ལྷག་པའི་བསམ་པ་དང་།
en: Noble son, they are (1) the blessings of the buddhas—the vessel of the bodhisattvas, (2) resolve—the vessel of pure motivation, (3) application—the vessel for propagating the path of awakening, (4) pure motivation—the vessel of extraordinary roots of virtue,

source: མང་དུ་ཐོས་པའི་སྣོད་དྲན་པ་དང་། ལམ་ལ་འཇུག་པའི་སྣོད་བློ་གྲོས་དང་། དོན་རྟོགས་པ་རྗེས་སུ་རྟོགས་པའི་སྣོད་རྟོགས་པ་དང་།
en: (5) recollection—the vessel of erudition, (6) intelligence—the vessel for entering the path, (7) understanding—the vessel for understanding the meaning,

source: ལོངས་སྤྱོད་ཆེན་པོའི་སྣོད་སྦྱིན་པ་དང་། བསམ་པ་ཡོངས་སུ་རྫོགས་པའི་སྣོད་ཚུལ་ཁྲིམས་དང་། སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་འཐོབ་པའི་སྣོད་བཟོད་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་འགྲུབ་པའི་སྣོད་བརྩོན་འགྲུས་དང་། སེམས་ལས་སུ་རུང་བའི་སྣོད་བསམ་གཏན་དང་། དོགས་པ་ཐམས་ཅད་ལས་རབ་ཏུ་འདས་པའི་སྣོད་ཤེས་རབ་དང་།
en: (8) generosity—the vessel of great wealth, (9) discipline—the vessel for fulfilling one’s wishes, (10) patience—the vessel for attaining the thirty-two marks of a great being, (11) diligence—the vessel for achieving all the qualities of a buddha, (12) concentration—the vessel of a capable mind, (13) insight—the vessel for completely transcending all doubts,

source: སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་སྙོམས་པའི་སྣོད་བྱམས་པ་དང་། དབུལ་ཞིང་ཉམ་ཐག་པ་ཐམས་ཅད་བསྐྱབས་པའི་སྣོད་སྙིང་རྗེ་དང་། ཆོས་ལ་དགའ་བའི་སྣོད་དགའ་བ་དང་། རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་སྤང་བའི་སྣོད་བཏང་སྙོམས་དང་།
en: (14) love—the vessel of an unbiased attitude toward all beings, (15) compassion—the vessel for protecting all poor and destitute beings, (16) joy—the vessel of joy in the Dharma, (17) equanimity—the vessel for abandoning attachment and aversion,

source: དགེ་བའི་རྩ་བ་ཐམས་ཅད་འཛིན་དུ་འཇུག་པའི་སྣོད་དགེ་བའི་བཤེས་གཉེན་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྣོད་ཐོས་པ་ཚོལ་བས་ངོམས་མི་མྱོང་བ་དང་།
en: (18) virtuous friends—the vessel for leading one to uphold all roots of virtue, (19) tirelessly pursuing learning—the vessel of the perfection of insight,

source: མི་ལྟོས་པའི་སྣོད་རབ་ཏུ་འབྱུང་བ་དང་། དོན་ཉུང་ཞིང་བྱ་བ་ཉུང་བའི་སྣོད་དགོན་པ་ལ་གནས་པ་དང་། བསམ་གཏན་དང་མངོན་པར་ཤེས་པའི་སྣོད་དབེན་པ་ལ་དགའ་བ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་སྣོད་བསྡུ་བའི་དངོས་པོ་དང་།
en: (20) going forth—the vessel of independence, (21) remaining in the wilderness—the vessel for having few desires and possessions, (22) enjoying solitude—the vessel of concentration and higher perception, (23) the means of attracting disciples—the vessel for ripening beings,

source: ཆོས་སྣང་བའི་སྣོད་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་དང་། ཐོས་པ་ཐམས་ཅད་འཛིན་པའི་སྣོད་གཟུངས་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐེ་ཙོམ་གཅད་པའི་སྣོད་སྤོབས་པ་དང་། སངས་རྒྱས་མཐོང་བའི་སྣོད་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་དང་།
en: (24) upholding the sacred Dharma—the vessel of the light of the Dharma, (25) retention—the vessel for remembering everything one hears, (26) eloquence—the vessel for eliminating the doubts of all beings, (27) recollecting the Buddha—the vessel for beholding buddhas,

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྣོད་ཆོས་རྗེས་སུ་དྲན་པ་དང་། དགེ་བའི་རྩ་བ་བསྲུང་བའི་སྣོད་ཞེ་སྡང་མེད་པའི་སེམས་དང་།
en: (28) recollecting the Dharma—the vessel of the perfection of insight, (29) the absence of anger—the vessel for guarding one’s roots of virtue,

source: ལྟ་བར་གྱུར་པ་ཐམས་ཅད་སྤོང་བའི་སྣོད་སྟོང་པ་ཉིད་ལ་མོས་པ་དང་། མཐར་འཛིན་པ་ཐམས་ཅད་ཡོངས་སུ་སྤོང་བའི་སྣོད་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དང་།
en: (30) trusting in emptiness—the vessel for abandoning all views, (31) dependent origination—the vessel for abandoning all extreme views,

source: མི་འཁྲུགས་ཤིང་ཕྱད་པར་ལུང་སྟོན་པའི་སྣོད་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པ་དང་།
en: (32) attaining acceptance of the unborn nature of phenomena—the vessel of undisturbed and continuous teaching, and
